SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_filt.h
/**************************************************************************//**
 * @file
 * @brief EFR32FG25 FILT register and bit field definitions
 ******************************************************************************
 * # License
 * <b>Copyright 2022 Silicon Laboratories, Inc. www.silabs.com</b>
 ******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 *****************************************************************************/
#ifndef EFR32FG25_FILT_H
#define EFR32FG25_FILT_H
#define FILT_HAS_SET_CLEAR

/**************************************************************************//**
* @addtogroup Parts
* @{
******************************************************************************/
/**************************************************************************//**
 * @defgroup EFR32FG25_FILT FILT
 * @{
 * @brief EFR32FG25 FILT Register Declaration.
 *****************************************************************************/

/** FILT FIR Register Group Declaration. */
typedef struct {
  __IOM uint32_t COEFF;                              /**< FIlter Cooefficient Value                          */
} FILT_FIR_TypeDef;

/** FILT Register Declaration. */
typedef struct {
  __IM uint32_t    IPVERSION;                   /**< IP Version ID                                      */
  __IOM uint32_t   EN;                          /**< Module Enable                                      */
  __IOM uint32_t   SWRST;                       /**< Software Reset                                     */
  __IOM uint32_t   CONNECT;                     /**< New Register                                       */
  __IOM uint32_t   DISCLK;                      /**< Disable Clocks                                     */
  uint32_t         RESERVED0[3U];               /**< Reserved for future use                            */
  __IOM uint32_t   FIFOIN;                      /**< New Register                                       */
  uint32_t         RESERVED1[7U];               /**< Reserved for future use                            */
  __IM uint32_t    FIFOOUT;                     /**< New Register                                       */
  uint32_t         RESERVED2[23U];              /**< Reserved for future use                            */
  uint32_t         RESERVED3[1U];               /**< Reserved for future use                            */
  uint32_t         RESERVED4[7U];               /**< Reserved for future use                            */
  __IOM uint32_t   FMTOUT;                      /**< New Register                                       */
  uint32_t         RESERVED5[79U];              /**< Reserved for future use                            */
  __IOM uint32_t   CFG;                         /**< Filter Config Register                             */
  __IOM uint32_t   CTRL;                        /**< Filter Control Register                            */
  __IOM uint32_t   NUMSKIP;                     /**< Number of Output Samples to Skip                   */
  uint32_t         RESERVED6[13U];              /**< Reserved for future use                            */
  FILT_FIR_TypeDef FIR[16U];                    /**<                                                    */
  uint32_t         RESERVED7[864U];             /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_SET;               /**< IP Version ID                                      */
  __IOM uint32_t   EN_SET;                      /**< Module Enable                                      */
  __IOM uint32_t   SWRST_SET;                   /**< Software Reset                                     */
  __IOM uint32_t   CONNECT_SET;                 /**< New Register                                       */
  __IOM uint32_t   DISCLK_SET;                  /**< Disable Clocks                                     */
  uint32_t         RESERVED8[3U];               /**< Reserved for future use                            */
  __IOM uint32_t   FIFOIN_SET;                  /**< New Register                                       */
  uint32_t         RESERVED9[7U];               /**< Reserved for future use                            */
  __IM uint32_t    FIFOOUT_SET;                 /**< New Register                                       */
  uint32_t         RESERVED10[23U];             /**< Reserved for future use                            */
  uint32_t         RESERVED11[1U];              /**< Reserved for future use                            */
  uint32_t         RESERVED12[7U];              /**< Reserved for future use                            */
  __IOM uint32_t   FMTOUT_SET;                  /**< New Register                                       */
  uint32_t         RESERVED13[79U];             /**< Reserved for future use                            */
  __IOM uint32_t   CFG_SET;                     /**< Filter Config Register                             */
  __IOM uint32_t   CTRL_SET;                    /**< Filter Control Register                            */
  __IOM uint32_t   NUMSKIP_SET;                 /**< Number of Output Samples to Skip                   */
  uint32_t         RESERVED14[13U];             /**< Reserved for future use                            */
  FILT_FIR_TypeDef FIR_SET[16U];                /**<                                                    */
  uint32_t         RESERVED15[864U];            /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_CLR;               /**< IP Version ID                                      */
  __IOM uint32_t   EN_CLR;                      /**< Module Enable                                      */
  __IOM uint32_t   SWRST_CLR;                   /**< Software Reset                                     */
  __IOM uint32_t   CONNECT_CLR;                 /**< New Register                                       */
  __IOM uint32_t   DISCLK_CLR;                  /**< Disable Clocks                                     */
  uint32_t         RESERVED16[3U];              /**< Reserved for future use                            */
  __IOM uint32_t   FIFOIN_CLR;                  /**< New Register                                       */
  uint32_t         RESERVED17[7U];              /**< Reserved for future use                            */
  __IM uint32_t    FIFOOUT_CLR;                 /**< New Register                                       */
  uint32_t         RESERVED18[23U];             /**< Reserved for future use                            */
  uint32_t         RESERVED19[1U];              /**< Reserved for future use                            */
  uint32_t         RESERVED20[7U];              /**< Reserved for future use                            */
  __IOM uint32_t   FMTOUT_CLR;                  /**< New Register                                       */
  uint32_t         RESERVED21[79U];             /**< Reserved for future use                            */
  __IOM uint32_t   CFG_CLR;                     /**< Filter Config Register                             */
  __IOM uint32_t   CTRL_CLR;                    /**< Filter Control Register                            */
  __IOM uint32_t   NUMSKIP_CLR;                 /**< Number of Output Samples to Skip                   */
  uint32_t         RESERVED22[13U];             /**< Reserved for future use                            */
  FILT_FIR_TypeDef FIR_CLR[16U];                /**<                                                    */
  uint32_t         RESERVED23[864U];            /**< Reserved for future use                            */
  __IM uint32_t    IPVERSION_TGL;               /**< IP Version ID                                      */
  __IOM uint32_t   EN_TGL;                      /**< Module Enable                                      */
  __IOM uint32_t   SWRST_TGL;                   /**< Software Reset                                     */
  __IOM uint32_t   CONNECT_TGL;                 /**< New Register                                       */
  __IOM uint32_t   DISCLK_TGL;                  /**< Disable Clocks                                     */
  uint32_t         RESERVED24[3U];              /**< Reserved for future use                            */
  __IOM uint32_t   FIFOIN_TGL;                  /**< New Register                                       */
  uint32_t         RESERVED25[7U];              /**< Reserved for future use                            */
  __IM uint32_t    FIFOOUT_TGL;                 /**< New Register                                       */
  uint32_t         RESERVED26[23U];             /**< Reserved for future use                            */
  uint32_t         RESERVED27[1U];              /**< Reserved for future use                            */
  uint32_t         RESERVED28[7U];              /**< Reserved for future use                            */
  __IOM uint32_t   FMTOUT_TGL;                  /**< New Register                                       */
  uint32_t         RESERVED29[79U];             /**< Reserved for future use                            */
  __IOM uint32_t   CFG_TGL;                     /**< Filter Config Register                             */
  __IOM uint32_t   CTRL_TGL;                    /**< Filter Control Register                            */
  __IOM uint32_t   NUMSKIP_TGL;                 /**< Number of Output Samples to Skip                   */
  uint32_t         RESERVED30[13U];             /**< Reserved for future use                            */
  FILT_FIR_TypeDef FIR_TGL[16U];                /**<                                                    */
} FILT_TypeDef;
