SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_filt.h
/** @} End of group EFR32FG25_FILT */

/**************************************************************************//**
 * @addtogroup EFR32FG25_FILT
 * @{
 * @defgroup EFR32FG25_FILT_BitFields FILT Bit Fields
 * @{
 *****************************************************************************/

/* Bit fields for FILT IPVERSION */
#define _FILT_IPVERSION_RESETVALUE           0x00000001UL                               /**< Default value for FILT_IPVERSION            */
#define _FILT_IPVERSION_MASK                 0xFFFFFFFFUL                               /**< Mask for FILT_IPVERSION                     */
#define _FILT_IPVERSION_IPVERSION_SHIFT      0                                          /**< Shift value for FILT_IPVERSION              */
#define _FILT_IPVERSION_IPVERSION_MASK       0xFFFFFFFFUL                               /**< Bit mask for FILT_IPVERSION                 */
#define _FILT_IPVERSION_IPVERSION_DEFAULT    0x00000001UL                               /**< Mode DEFAULT for FILT_IPVERSION             */
#define FILT_IPVERSION_IPVERSION_DEFAULT     (_FILT_IPVERSION_IPVERSION_DEFAULT << 0)   /**< Shifted mode DEFAULT for FILT_IPVERSION     */

/* Bit fields for FILT EN */
#define _FILT_EN_RESETVALUE                  0x00000000UL                               /**< Default value for FILT_EN                   */
#define _FILT_EN_MASK                        0x00000003UL                               /**< Mask for FILT_EN                            */
#define FILT_EN_EN                           (0x1UL << 0)                               /**< Module Enable                               */
#define _FILT_EN_EN_SHIFT                    0                                          /**< Shift value for FILT_EN                     */
#define _FILT_EN_EN_MASK                     0x1UL                                      /**< Bit mask for FILT_EN                        */
#define _FILT_EN_EN_DEFAULT                  0x00000000UL                               /**< Mode DEFAULT for FILT_EN                    */
#define FILT_EN_EN_DEFAULT                   (_FILT_EN_EN_DEFAULT << 0)                 /**< Shifted mode DEFAULT for FILT_EN            */
#define FILT_EN_DISABLING                    (0x1UL << 1)                               /**< Disablement Busy Status                     */
#define _FILT_EN_DISABLING_SHIFT             1                                          /**< Shift value for FILT_DISABLING              */
#define _FILT_EN_DISABLING_MASK              0x2UL                                      /**< Bit mask for FILT_DISABLING                 */
#define _FILT_EN_DISABLING_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for FILT_EN                    */
#define FILT_EN_DISABLING_DEFAULT            (_FILT_EN_DISABLING_DEFAULT << 1)          /**< Shifted mode DEFAULT for FILT_EN            */

/* Bit fields for FILT SWRST */
#define _FILT_SWRST_RESETVALUE               0x00000000UL                               /**< Default value for FILT_SWRST                */
#define _FILT_SWRST_MASK                     0x00000003UL                               /**< Mask for FILT_SWRST                         */
#define FILT_SWRST_SWRST                     (0x1UL << 0)                               /**< Software Reset Command                      */
#define _FILT_SWRST_SWRST_SHIFT              0                                          /**< Shift value for FILT_SWRST                  */
#define _FILT_SWRST_SWRST_MASK               0x1UL                                      /**< Bit mask for FILT_SWRST                     */
#define _FILT_SWRST_SWRST_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for FILT_SWRST                 */
#define FILT_SWRST_SWRST_DEFAULT             (_FILT_SWRST_SWRST_DEFAULT << 0)           /**< Shifted mode DEFAULT for FILT_SWRST         */
#define FILT_SWRST_RESETTING                 (0x1UL << 1)                               /**< Software Reset Busy Status                  */
#define _FILT_SWRST_RESETTING_SHIFT          1                                          /**< Shift value for FILT_RESETTING              */
#define _FILT_SWRST_RESETTING_MASK           0x2UL                                      /**< Bit mask for FILT_RESETTING                 */
#define _FILT_SWRST_RESETTING_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for FILT_SWRST                 */
#define FILT_SWRST_RESETTING_DEFAULT         (_FILT_SWRST_RESETTING_DEFAULT << 1)       /**< Shifted mode DEFAULT for FILT_SWRST         */

/* Bit fields for FILT CONNECT */
#define _FILT_CONNECT_RESETVALUE             0x00000000UL                               /**< Default value for FILT_CONNECT              */
#define _FILT_CONNECT_MASK                   0x00000101UL                               /**< Mask for FILT_CONNECT                       */
#define FILT_CONNECT_IN                      (0x1UL << 0)                               /**< Input FIFO connect                          */
#define _FILT_CONNECT_IN_SHIFT               0                                          /**< Shift value for FILT_IN                     */
#define _FILT_CONNECT_IN_MASK                0x1UL                                      /**< Bit mask for FILT_IN                        */
#define _FILT_CONNECT_IN_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_CONNECT               */
#define FILT_CONNECT_IN_DEFAULT              (_FILT_CONNECT_IN_DEFAULT << 0)            /**< Shifted mode DEFAULT for FILT_CONNECT       */
#define FILT_CONNECT_OUT                     (0x1UL << 8)                               /**< Output FIFO connect                         */
#define _FILT_CONNECT_OUT_SHIFT              8                                          /**< Shift value for FILT_OUT                    */
#define _FILT_CONNECT_OUT_MASK               0x100UL                                    /**< Bit mask for FILT_OUT                       */
#define _FILT_CONNECT_OUT_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for FILT_CONNECT               */
#define FILT_CONNECT_OUT_DEFAULT             (_FILT_CONNECT_OUT_DEFAULT << 8)           /**< Shifted mode DEFAULT for FILT_CONNECT       */

/* Bit fields for FILT DISCLK */
#define _FILT_DISCLK_RESETVALUE              0x00000002UL                               /**< Default value for FILT_DISCLK               */
#define _FILT_DISCLK_MASK                    0x00000003UL                               /**< Mask for FILT_DISCLK                        */
#define _FILT_DISCLK_DISCLK_SHIFT            0                                          /**< Shift value for FILT_DISCLK                 */
#define _FILT_DISCLK_DISCLK_MASK             0x3UL                                      /**< Bit mask for FILT_DISCLK                    */
#define _FILT_DISCLK_DISCLK_DEFAULT          0x00000002UL                               /**< Mode DEFAULT for FILT_DISCLK                */
#define _FILT_DISCLK_DISCLK_NONE             0x00000000UL                               /**< Mode NONE for FILT_DISCLK                   */
#define _FILT_DISCLK_DISCLK_ALL              0x00000001UL                               /**< Mode ALL for FILT_DISCLK                    */
#define _FILT_DISCLK_DISCLK_AUTO             0x00000002UL                               /**< Mode AUTO for FILT_DISCLK                   */
#define FILT_DISCLK_DISCLK_DEFAULT           (_FILT_DISCLK_DISCLK_DEFAULT << 0)         /**< Shifted mode DEFAULT for FILT_DISCLK        */
#define FILT_DISCLK_DISCLK_NONE              (_FILT_DISCLK_DISCLK_NONE << 0)            /**< Shifted mode NONE for FILT_DISCLK           */
#define FILT_DISCLK_DISCLK_ALL               (_FILT_DISCLK_DISCLK_ALL << 0)             /**< Shifted mode ALL for FILT_DISCLK            */
#define FILT_DISCLK_DISCLK_AUTO              (_FILT_DISCLK_DISCLK_AUTO << 0)            /**< Shifted mode AUTO for FILT_DISCLK           */

