SiliconLabs/gecko_sdk/platform/Device/SiliconLabs/EFR32FG25/Include/efr32fg25_filt.h
/* Bit fields for FILT FIFOIN */
#define _FILT_FIFOIN_RESETVALUE              0x00000000UL                               /**< Default value for FILT_FIFOIN               */
#define _FILT_FIFOIN_MASK                    0x1FFF3F0FUL                               /**< Mask for FILT_FIFOIN                        */
#define _FILT_FIFOIN_FID_SHIFT               0                                          /**< Shift value for FILT_FID                    */
#define _FILT_FIFOIN_FID_MASK                0xFUL                                      /**< Bit mask for FILT_FID                       */
#define _FILT_FIFOIN_FID_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOIN                */
#define FILT_FIFOIN_FID_DEFAULT              (_FILT_FIFOIN_FID_DEFAULT << 0)            /**< Shifted mode DEFAULT for FILT_FIFOIN        */
#define _FILT_FIFOIN_CID_SHIFT               8                                          /**< Shift value for FILT_CID                    */
#define _FILT_FIFOIN_CID_MASK                0x3F00UL                                   /**< Bit mask for FILT_CID                       */
#define _FILT_FIFOIN_CID_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOIN                */
#define FILT_FIFOIN_CID_DEFAULT              (_FILT_FIFOIN_CID_DEFAULT << 8)            /**< Shifted mode DEFAULT for FILT_FIFOIN        */
#define _FILT_FIFOIN_REM_SHIFT               16                                         /**< Shift value for FILT_REM                    */
#define _FILT_FIFOIN_REM_MASK                0xFF0000UL                                 /**< Bit mask for FILT_REM                       */
#define _FILT_FIFOIN_REM_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOIN                */
#define FILT_FIFOIN_REM_DEFAULT              (_FILT_FIFOIN_REM_DEFAULT << 16)           /**< Shifted mode DEFAULT for FILT_FIFOIN        */
#define _FILT_FIFOIN_ALARM_SHIFT             24                                         /**< Shift value for FILT_ALARM                  */
#define _FILT_FIFOIN_ALARM_MASK              0x1F000000UL                               /**< Bit mask for FILT_ALARM                     */
#define _FILT_FIFOIN_ALARM_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOIN                */
#define FILT_FIFOIN_ALARM_DEFAULT            (_FILT_FIFOIN_ALARM_DEFAULT << 24)         /**< Shifted mode DEFAULT for FILT_FIFOIN        */

/* Bit fields for FILT FIFOOUT */
#define _FILT_FIFOOUT_RESETVALUE             0x00000000UL                               /**< Default value for FILT_FIFOOUT              */
#define _FILT_FIFOOUT_MASK                   0x1FFF0000UL                               /**< Mask for FILT_FIFOOUT                       */
#define _FILT_FIFOOUT_CNT_SHIFT              16                                         /**< Shift value for FILT_CNT                    */
#define _FILT_FIFOOUT_CNT_MASK               0xFF0000UL                                 /**< Bit mask for FILT_CNT                       */
#define _FILT_FIFOOUT_CNT_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOOUT               */
#define FILT_FIFOOUT_CNT_DEFAULT             (_FILT_FIFOOUT_CNT_DEFAULT << 16)          /**< Shifted mode DEFAULT for FILT_FIFOOUT       */
#define _FILT_FIFOOUT_ALARM_SHIFT            24                                         /**< Shift value for FILT_ALARM                  */
#define _FILT_FIFOOUT_ALARM_MASK             0x1F000000UL                               /**< Bit mask for FILT_ALARM                     */
#define _FILT_FIFOOUT_ALARM_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for FILT_FIFOOUT               */
#define FILT_FIFOOUT_ALARM_DEFAULT           (_FILT_FIFOOUT_ALARM_DEFAULT << 24)        /**< Shifted mode DEFAULT for FILT_FIFOOUT       */

/* Bit fields for FILT FMTOUT */
#define _FILT_FMTOUT_RESETVALUE              0x0000000BUL                               /**< Default value for FILT_FMTOUT               */
#define _FILT_FMTOUT_MASK                    0x0000001FUL                               /**< Mask for FILT_FMTOUT                        */
#define _FILT_FMTOUT_ELEMSIZE_SHIFT          0                                          /**< Shift value for FILT_ELEMSIZE               */
#define _FILT_FMTOUT_ELEMSIZE_MASK           0x1FUL                                     /**< Bit mask for FILT_ELEMSIZE                  */
#define _FILT_FMTOUT_ELEMSIZE_DEFAULT        0x0000000BUL                               /**< Mode DEFAULT for FILT_FMTOUT                */
#define FILT_FMTOUT_ELEMSIZE_DEFAULT         (_FILT_FMTOUT_ELEMSIZE_DEFAULT << 0)       /**< Shifted mode DEFAULT for FILT_FMTOUT        */

/* Bit fields for FILT CFG */
#define _FILT_CFG_RESETVALUE                 0x00000080UL                               /**< Default value for FILT_CFG                  */
#define _FILT_CFG_MASK                       0x013F77BFUL                               /**< Mask for FILT_CFG                           */
#define _FILT_CFG_NTAPS_SHIFT                0                                          /**< Shift value for FILT_NTAPS                  */
#define _FILT_CFG_NTAPS_MASK                 0x3FUL                                     /**< Bit mask for FILT_NTAPS                     */
#define _FILT_CFG_NTAPS_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define FILT_CFG_NTAPS_DEFAULT               (_FILT_CFG_NTAPS_DEFAULT << 0)             /**< Shifted mode DEFAULT for FILT_CFG           */
#define FILT_CFG_SYMMETRIC                   (0x1UL << 7)                               /**< Symmetric filter                            */
#define _FILT_CFG_SYMMETRIC_SHIFT            7                                          /**< Shift value for FILT_SYMMETRIC              */
#define _FILT_CFG_SYMMETRIC_MASK             0x80UL                                     /**< Bit mask for FILT_SYMMETRIC                 */
#define _FILT_CFG_SYMMETRIC_DEFAULT          0x00000001UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define FILT_CFG_SYMMETRIC_DEFAULT           (_FILT_CFG_SYMMETRIC_DEFAULT << 7)         /**< Shifted mode DEFAULT for FILT_CFG           */
#define _FILT_CFG_INTERP_SHIFT               8                                          /**< Shift value for FILT_INTERP                 */
#define _FILT_CFG_INTERP_MASK                0x700UL                                    /**< Bit mask for FILT_INTERP                    */
#define _FILT_CFG_INTERP_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define FILT_CFG_INTERP_DEFAULT              (_FILT_CFG_INTERP_DEFAULT << 8)            /**< Shifted mode DEFAULT for FILT_CFG           */
#define _FILT_CFG_DECIM_SHIFT                12                                         /**< Shift value for FILT_DECIM                  */
#define _FILT_CFG_DECIM_MASK                 0x7000UL                                   /**< Bit mask for FILT_DECIM                     */
#define _FILT_CFG_DECIM_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define FILT_CFG_DECIM_DEFAULT               (_FILT_CFG_DECIM_DEFAULT << 12)            /**< Shifted mode DEFAULT for FILT_CFG           */
#define _FILT_CFG_NSHIFT_SHIFT               16                                         /**< Shift value for FILT_NSHIFT                 */
#define _FILT_CFG_NSHIFT_MASK                0x3F0000UL                                 /**< Bit mask for FILT_NSHIFT                    */
#define _FILT_CFG_NSHIFT_DEFAULT             0x00000000UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define FILT_CFG_NSHIFT_DEFAULT              (_FILT_CFG_NSHIFT_DEFAULT << 16)           /**< Shifted mode DEFAULT for FILT_CFG           */
#define FILT_CFG_SKIPFIRST                   (0x1UL << 24)                              /**< Skip First Output Samples                   */
#define _FILT_CFG_SKIPFIRST_SHIFT            24                                         /**< Shift value for FILT_SKIPFIRST              */
#define _FILT_CFG_SKIPFIRST_MASK             0x1000000UL                                /**< Bit mask for FILT_SKIPFIRST                 */
#define _FILT_CFG_SKIPFIRST_DEFAULT          0x00000000UL                               /**< Mode DEFAULT for FILT_CFG                   */
#define _FILT_CFG_SKIPFIRST_NO_SKIP          0x00000000UL                               /**< Mode NO_SKIP for FILT_CFG                   */
#define _FILT_CFG_SKIPFIRST_SKIP_FIRST       0x00000001UL                               /**< Mode SKIP_FIRST for FILT_CFG                */
#define FILT_CFG_SKIPFIRST_DEFAULT           (_FILT_CFG_SKIPFIRST_DEFAULT << 24)        /**< Shifted mode DEFAULT for FILT_CFG           */
#define FILT_CFG_SKIPFIRST_NO_SKIP           (_FILT_CFG_SKIPFIRST_NO_SKIP << 24)        /**< Shifted mode NO_SKIP for FILT_CFG           */
#define FILT_CFG_SKIPFIRST_SKIP_FIRST        (_FILT_CFG_SKIPFIRST_SKIP_FIRST << 24)     /**< Shifted mode SKIP_FIRST for FILT_CFG        */

/* Bit fields for FILT CTRL */
#define _FILT_CTRL_RESETVALUE                0x00000000UL                               /**< Default value for FILT_CTRL                 */
#define _FILT_CTRL_MASK                      0xC0000001UL                               /**< Mask for FILT_CTRL                          */
#define FILT_CTRL_ENAB                       (0x1UL << 0)                               /**< Enable Filter                               */
#define _FILT_CTRL_ENAB_SHIFT                0                                          /**< Shift value for FILT_ENAB                   */
#define _FILT_CTRL_ENAB_MASK                 0x1UL                                      /**< Bit mask for FILT_ENAB                      */
#define _FILT_CTRL_ENAB_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for FILT_CTRL                  */
#define FILT_CTRL_ENAB_DEFAULT               (_FILT_CTRL_ENAB_DEFAULT << 0)             /**< Shifted mode DEFAULT for FILT_CTRL          */
#define FILT_CTRL_SKIPRST                    (0x1UL << 30)                              /**< Reset the Output Sample Skip Counter        */
#define _FILT_CTRL_SKIPRST_SHIFT             30                                         /**< Shift value for FILT_SKIPRST                */
#define _FILT_CTRL_SKIPRST_MASK              0x40000000UL                               /**< Bit mask for FILT_SKIPRST                   */
#define _FILT_CTRL_SKIPRST_DEFAULT           0x00000000UL                               /**< Mode DEFAULT for FILT_CTRL                  */
#define FILT_CTRL_SKIPRST_DEFAULT            (_FILT_CTRL_SKIPRST_DEFAULT << 30)         /**< Shifted mode DEFAULT for FILT_CTRL          */
#define FILT_CTRL_RSTFSM                     (0x1UL << 31)                              /**< Reset FSM                                   */
#define _FILT_CTRL_RSTFSM_SHIFT              31                                         /**< Shift value for FILT_RSTFSM                 */
#define _FILT_CTRL_RSTFSM_MASK               0x80000000UL                               /**< Bit mask for FILT_RSTFSM                    */
#define _FILT_CTRL_RSTFSM_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for FILT_CTRL                  */
#define FILT_CTRL_RSTFSM_DEFAULT             (_FILT_CTRL_RSTFSM_DEFAULT << 31)          /**< Shifted mode DEFAULT for FILT_CTRL          */

/* Bit fields for FILT NUMSKIP */
#define _FILT_NUMSKIP_RESETVALUE             0x00000000UL                               /**< Default value for FILT_NUMSKIP              */
#define _FILT_NUMSKIP_MASK                   0x000000FFUL                               /**< Mask for FILT_NUMSKIP                       */
#define _FILT_NUMSKIP_NUMSKIP_SHIFT          0                                          /**< Shift value for FILT_NUMSKIP                */
#define _FILT_NUMSKIP_NUMSKIP_MASK           0xFFUL                                     /**< Bit mask for FILT_NUMSKIP                   */
#define _FILT_NUMSKIP_NUMSKIP_DEFAULT        0x00000000UL                               /**< Mode DEFAULT for FILT_NUMSKIP               */
#define FILT_NUMSKIP_NUMSKIP_DEFAULT         (_FILT_NUMSKIP_NUMSKIP_DEFAULT << 0)       /**< Shifted mode DEFAULT for FILT_NUMSKIP       */

/* Bit fields for FILT COEFF */
#define _FILT_COEFF_RESETVALUE               0x00000000UL                               /**< Default value for FILT_COEFF                */
#define _FILT_COEFF_MASK                     0x00007FFFUL                               /**< Mask for FILT_COEFF                         */
#define _FILT_COEFF_COEFF_SHIFT              0                                          /**< Shift value for FILT_COEFF                  */
#define _FILT_COEFF_COEFF_MASK               0x7FFFUL                                   /**< Bit mask for FILT_COEFF                     */
#define _FILT_COEFF_COEFF_DEFAULT            0x00000000UL                               /**< Mode DEFAULT for FILT_COEFF                 */
#define FILT_COEFF_COEFF_DEFAULT             (_FILT_COEFF_COEFF_DEFAULT << 0)           /**< Shifted mode DEFAULT for FILT_COEFF         */

/** @} End of group EFR32FG25_FILT_BitFields */
/** @} End of group EFR32FG25_FILT */
/** @} End of group Parts */

#endif /* EFR32FG25_FILT_H */
